Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །ཀླུའི་བདག་པོ་བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ལྷ་དང་མིས་བསྔགས་པའི་ཆོས་བརྒྱད་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon lying acquire eight qualities that earn praise from gods and humans.

source: ཨུཏྤ་ལའི་དྲི་འབྱུང་བས་ཁ་དོག་ཡོངས་སུ་དག་པ་འཐོབ་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ཚད་མར་འགྱུར་བ་དང་། ལྷ་དང་མི་དགའ་བས་དཔང་གཅིག་པུར་འགྱུར་བ་དང་། ཡང་དག་པའི་བསམ་པ་དང་ལྡན་པས་དོགས་པ་མེད་པར་འགྱུར་བ་དང་། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པས་ལུས་དང་ངག་དང་སེམས་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། ཚིག་འཁྲུལ་པ་མེད་པས་མཆོག་ཏུ་དགའ་བ་མང་བར་འགྱུར་བ་དང་། ཚིག་གཟུང་བར་འོས་པས་ངག་མཉན་པར་འགྱུར་བ་དང་། ཤེས་རབ་ཐོབ་པས་ལྷ་དང་མིར་སྐྱེས་ན་ཡང་དཔང་གཅིག་པུར་འགྱུར་བ་ཡིན་ཏེ།
en: becoming trustworthy in the eyes of the whole world; becoming a reliable witness favored by gods and humans; becoming fearless through having correct intention; becoming purified in body, speech, and mind through abundant pure motivation; having one’s joy increase to the utmost through using undeluded words;

source: བརྒྱད་པོ་དེ་དག་གོ།
en: finding one’s speech is well heeded through using words that are well worth recalling; and achieving insight that makes one a reliable witness in spite of being born in the human and god realms.

source: །བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་བདེན་པའི་རྗེས་སུ་འཇུག་པའི་ཚིག་ཏུ་འགྱུར་རོ།
en: If the roots of virtue of abandoning lying are dedicated to unsurpassed and perfect awakening, one’s words will be based on the truth.

source: །ཀླུའི་བདག་པོ་ཕྲ་མ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་མི་ཕྱེད་པ་ལྔ་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon divisive speech acquire five indivisible qualities.

source: གཞན་གྱིས་གནོད་པར་བྱ་བ་དང་བྲལ་བས་ལུས་མི་ཕྱེད་པ་འཐོབ་པ་དང་། གཞན་དག་གི་ལ་ཆགས་པ་མེད་པས་གཡོག་འཁོར་མི་ཕྱེད་པ་འཐོབ་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མཐོང་བས་དད་པ་མི་ཕྱེད་པ་འཐོབ་པ་དང་། སྒྲུབ་པ་སྙིང་པོར་བྱེད་པས་ཆོས་ལས་མི་ཕྱེད་པ་འཐོབ་པ་དང་། མི་སླུ་བས་མཛའ་བཤེས་མི་ཕྱེད་པ་འཐོབ་པ་སྟེ། ལྔ་པོ་དེ་དག་གོ།
en: The five are acquiring an indivisible body because one is free from harm done by others, acquiring an indivisible retinue of servants because one is not attached to the belongings of others, acquiring indivisible faith because one can see the ripening of karma, becoming indivisible from the Dharma because one engages in the essential practice, and acquiring indivisible friends because one does not deceive anyone.

source: །དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་གཡོག་འཁོར་མི་ཕྱེད་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་ཏེ།
en: If these roots of virtue are dedicated to unsurpassed and perfect awakening, one will become a fully awakened buddha, a worthy one, a thus-gone one with an inseparable retinue of followers.

source: དེའི་འཁོར་བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་དབྱེ་བར་མི་ནུས་སོ།
en: Neither māras nor the calumny of adversaries will be able to divide this assembly.

source: །ཀླུའི་བདག་པོ་ངག་རྩུབ་པོ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ངག་ཡོངས་སུ་དག་པ་བརྒྱད་འཐོབ་ལ། ཤི་འཕོས་ན་ཡང་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Nāga Lord, people who abandon harsh speech acquire eight aspects of pure speech and, even when they die, will be reborn among gods and humans.

source: རན་པའི་ཚིག་དང་། ཕན་པའི་ཚིག་དང་། རིགས་པའི་ཚིག་དང་། འཇམ་པའི་ཚིག་དང་། གཟུང་བའི་ཚིག་དང་། མཉན་པའི་ཚིག་དང་། སྐྱེ་བོ་མང་པོ་དགའ་བའི་ཚིག་དང་། མི་སྨད་པའི་ཚིག་སྟེ། བརྒྱད་པོ་དེ་དག་གོ།
en: The eight are balanced words, beneficial words, sensible words, gentle words, apprehended words, heeded words, words that many beings enjoy, and irreproachable words.

source: །དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་ཚངས་པའི་སྒྲ་སྐད་ཀྱི་གདངས་ཅན་གྱི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: If these roots of virtue are dedicated to unsurpassed and perfect awakening, such people will become thus-gone ones with the voice of Brahmā.

source: །ཀླུའི་བདག་པོ་ཚིག་ཀྱལ་པ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་གཅིག་ཏུ་ངེས་པ་གསུམ་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon idle chatter acquire three absolute certainties.

source: མཁས་པ་རྣམས་གཅིག་ཏུ་ངེས་པར་དགའ་བ་དང་། ལན་ལེགས་པར་གློན་པས་གཅིག་ཏུ་ངེས་པར་དེའི་བློ་བདེན་པ་ལ་འགྲོ་བ་དང་། བཅོས་མ་མ་ཡིན་པས་གཅིག་ཏུ་ངེས་པར་ལྷ་དང་མིའི་བདག་ཉིད་ཆེན་པོ་འཐོབ་པ་སྟེ། གསུམ་པོ་དེ་དག་གོ།
en: The three are that they will certainly be appreciated by the learned, their minds will certainly adhere to the truth as they give good responses, and they will certainly become great beings among gods and humans because of being free from falsity.

source: །དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་ཕྱད་པར་ལུང་སྟོན་ཅིང་གཞན་དུ་མི་གསུང་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: If these roots of virtue are dedicated to unsurpassed and perfect awakening, such people will become thus-gone ones who always teach and who do not speak in other ways.

source: །ཀླུའི་བདག་པོ་བརྣབ་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་བདག་པོའི་ཆོས་ལྔ་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon covetousness acquire five qualities of mastery.

source: དབང་པོ་མ་ཚང་བ་མེད་པས་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་བདག་པོ་འཐོབ་པ་དང་། དགྲ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བས་ལོངས་སྤྱོད་དང་དབང་ཕྱུག་རྒྱ་ཆེན་པོའི་བདག་པོ་འཐོབ་པ་དང་། བསོད་ནམས་ལ་དབང་བྱེད་པས་དེའི་སེམས་ཉེ་བར་སྤྱད་པ་དང་། ལོངས་སྤྱོད་རྒྱ་ཆེན་པོ་རྣམས་ལ་འཇུག་པ་དང་ཕྱིས་བཀྲབ་པ་ཐོབ་པས་རྒྱལ་པོ་བདག་པོས་མཆོད་པ་དང་། སྔོན་ཕྲག་དོག་མེད་པས་ལོངས་སྤྱོད་ཇི་ལྟར་སྨོན་པ་རྣམས་འབུམ་གྱུར་དུ་ཁྱད་དུ་འགྱུར་བ་འཐོབ་པ་སྟེ་ལྔ་པོ་དེ་དག་གོ།
en: The five are mastery of body, speech, and mind through lacking no faculties; mastery of wealth and vast power through being unconquerable by any enemies; gaining control of merit, which delights the mind; mastery of royalty due to obtaining and maintaining great wealth; and attaining many thousand times over what one aspires to due to having had no jealousy.

source: །དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད་པའི་དེ་བཞིན་གཤེགས་པ་སྟོན་པ་གཅིག་པུར་འགྱུར་རོ།
en: If these roots of virtue are dedicated to unsurpassed and perfect awakening, such people will become the singular teacher, the thus-gone one venerated by the threefold world.

source: །ཀླུའི་བདག་པོ་གནོད་སེམས་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡིད་བདེ་བར་བྱེད་པའི་ཆོས་བརྒྱད་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon malice acquire eight qualities that make the mind blissful.

source: དེའི་སེམས་རྣམ་པར་མི་འཚེ་བ་ལ་འཇུག་པ་དང་། དེའི་གནོད་སེམས་རབ་ཏུ་ཞི་བ་ལ་འཇུག་པ་དང་། དེའི་སེམས་རྩོད་པ་མེད་ཅིང་འཐབ་པ་མེད་པ་ལ་འཇུག་པ་དང་། དེའི་སེམས་འཇམ་པ་དང་མཉེན་པ་དང་། དེས་པ་ལ་འཇུག་པ་དང་། བྱམས་པའི་སེམས་དང་ལྡན་པའི་ཕྱིར་འཕགས་པའི་སྐྱེ་བོས་བཀུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་ལ་མངོན་པར་དགའ་བའི་ཕྱིར་ཕན་པའི་དངོས་པོ་མང་བ་དང་། སྐྱེ་བོ་མང་པོས་བཀུར་སྟི་བྱ་བའི་ཕྱིར་མཛེས་པ་དང་། སེམས་འཇམ་ཞིང་ལས་སུ་རུང་བའི་ཕྱིར་དེ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་དཀའ་བ་མེད་པ་སྟེ།
en: engaging in gentleness, softness, and discipline; being served by noble beings on account of having a loving mind; having an abundance of beneficial experiences on account of being pleased by the joys of all beings; being beautiful on account of being served by many beings; and facing no difficulty in being reborn in the Brahmā world on account of having a mind that is gentle and pliant.

source: བརྒྱད་པོ་དེ་དག་གོ། །དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་སེམས་ཐོགས་པ་མེད་པའི་དེ་བཞིན་གཤེགས་པ་ལྟ་བས་ཆོག་མི་ཤེས་པར་འགྱུར་རོ།
en: If these roots of virtue are dedicated to unsurpassed and perfect awakening, such people will become thus-gone ones whose minds are unobstructed, and whom no one will tire of beholding.

source: །ཀླུའི་བདག་པོ་ལོག་པར་ལྟ་བ་སྤངས་པའི་སྐྱེས་བུ་གང་ཟག་ནི་ཡོན་ཏན་གྱི་ཆོས་བཅུ་འཐོབ་སྟེ།
en: “Nāga Lord, people who abandon wrong views acquire ten positive qualities.

source: བསམ་པ་དགེ་བར་འགྱུར་ཞིང་གྲོགས་པོ་དགེ་བ་རྙེད་པ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་ཏེ།
en: They are becoming virtuous in thought and finding virtuous companions;

source: སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་པ་དང་། ལྷར་སངས་རྒྱས་འཛིན་ཏེ་གཞན་ལྷར་མི་འཛིན་པ་དང་། དགེ་མཚན་དང་བཀྲ་ཤིས་སུ་འཛིན་པ་མེད་པས་ལྟ་བ་དྲང་བ་དང་། གྲོགས་ལྷ་དང་མི་ཡིན་ཏེ།
en: refraining from evil deeds at the cost of one’s life because of trust in karmic ripening; counting the buddhas as divine, but not others; having an honest view by having no clinging to positive and auspicious signs;

source: དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་གྲོགས་མ་ཡིན་པ་དང་། བསོད་ནམས་འབར་བས་ཁྱད་པར་དུ་འགྲོ་བ་དང་། ལོག་པ་ཐམས་ཅད་མེད་པས་འཕགས་པའི་ལམ་དུ་ཞུགས་པ་དང་། འཇིག་ཚོགས་ལ་ལྟ་བ་ལས་བསྐྱོད་དེ་སྡིག་པའི་ལྟ་བ་ཐམས་ཅད་དང་བྲལ་བ་དང་། སྒྲིབ་པ་མེད་པར་མཐོང་བ་ཡིན་ཏེ།
en: associating with gods and humans, but not with beings of the animal realms and the realms of Yama; becoming distinguished by the expansion of merit; entering the path of noble ones by abandoning all mistaken pursuits; eliminating all evil views by shifting away from personalistic false views; entering in the correct way by seeing without obscuration;

source: ཡང་དག་པར་སོང་བ་ཡང་དག་པར་ཞུགས་པ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་ནང་ན་མི་ཁོམ་པ་དང་བྲལ་བ་ཡིན་ཏེ་བཅུ་པོ་དེ་དག་གོ།
en: and avoiding all the unfavorable situations within the human and god realms.

source: །ལོག་པར་ལྟ་བ་སྤངས་པའི་དགེ་བའི་རྩ་བ་དེ་གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་ན། དེས་དེ་བྱང་ཆུབ་ཐོབ་པ་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དེ་ལ་མངོན་སུམ་དུ་འགྱུར་ཞིང་མངོན་པར་ཤེས་པ་མྱུར་བའི་དེ་བཞིན་གཤེགས་པར་འགྱུར་རོ།
en: If such people dedicate the roots of virtue of abandoning wrong views to unsurpassed and perfect awakening, then upon attaining awakening, all the qualities of buddhahood will manifest, and they will become thus-gone ones who are swift in the higher knowledges.

source: །ཀླུའི་བདག་པོ་དེ་ལ་སྲོག་གཅོད་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་།
en: “Nāga Lord, regarding this, if bodhisattvas who abandon taking life practice giving, their wealth will increase, and also their lifespan will extend.

source: ཚེ་རིང་བར་ཡང་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་གཞན་གྱིས་གནོད་པར་བྱ་བ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, no harm done by others will impact them.

source: །མ་བྱིན་པར་ལེན་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན།
en: “If bodhisattvas who abandon stealing practice giving, their wealth will increase and also become impossible to steal.

source: ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ལོངས་སྤྱོད་མི་འཕྲོགས་པར་ཡང་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པས་བླ་ན་མེད་པ་ཐོབ་པར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, they will accomplish all roots of virtue and thereby achieve the unsurpassed.

source: །འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ཆུང་མ་མི་གཡེམ་པར་ཡང་འགྱུར་རོ།
en: “If bodhisattvas who abandon sexual misconduct practice giving, their wealth will increase, and also their partners will not cheat on them.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་དེའི་མ་དང་། བུ་དང་ཆུང་མ་ལ་སུ་ཡང་ཆགས་པའི་སེམས་ཀྱིས་ལྟ་བར་མི་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, anyone who would have a desirous attitude toward their mother, children, or partner will be unable to actually see them.

source: །བརྫུན་དུ་སྨྲ་བ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན། ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ལོངས་སྤྱོད་མི་འཕྲོགས་པ་དང་། སྐུར་པ་འདེབས་པ་མེད་པར་འགྱུར་བའི་ལམ་ཡང་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: “If bodhisattvas who abandon lying practice giving, their wealth will increase, their possessions will be invulnerable to theft, and they will uphold the irreproachable path.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་དེ་དམ་བཅས་པ་བརྟན་པར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, they will practice exactly what they preach and be firm in their promises.

source: །ཕྲ་མ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་གཡོག་འཁོར་མི་ཕྱེད་པར་ཡང་འགྱུར་རོ།
en: “If bodhisattvas who abandon divisive speech practice giving, their wealth will increase, and their retinue will be impervious to division.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་བསམ་པ་འཐུན་པས་བྱང་ཆུབ་སེམས་དཔའི་གཡོག་འཁོར་འཐོབ་བོ།
en: As they engage in bodhisattva conduct, they will achieve a retinue of bodhisattvas through their accommodating attitude.

source: །ངག་རྩུབ་པོ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ཚིག་བཙུན་པར་འགྱུར་ལ་ཚིག་སུན་དབྱུང་དུ་མེད་པར་ཡང་འགྱུར་རོ།
en: “If bodhisattvas who abandon harsh speech practice giving, their wealth will increase, and their words will become gentle and never grating.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་འཁོར་མ་མགུ་བར་སུ་ཡང་མི་འགྲོའོ།
en: As they engage in bodhisattva conduct, no one in their retinue will become displeased.

source: །ཚིག་ཀྱལ་པ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ཚིག་སྙན་པར་ཡང་འགྱུར་རོ།
en: “If bodhisattvas who abandon idle chatter practice giving, their wealth will increase, and their words will become pleasing.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་ལ་མཁས་པར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, they will become skilled in severing all doubts.

source: །བརྣབ་སེམས་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་ལོངས་སྤྱོད་དང་ཡོངས་སུ་སྤྱད་པ་རྒྱ་ཆེན་པོ་དག་ལ་དེའི་སེམས་འཇུག་པར་འགྱུར་རོ།
en: “If bodhisattvas who abandon covetousness practice giving, their wealth will increase, and they will enter into the frame of mind where they can extensively enjoy and savor it.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་རྒྱ་ཆེན་པོ་ལ་མོས་ཤིང་དབང་ཆེ་བར་གྲགས་པར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, they will be inspired toward vastness and become renowned for their might.

source: །གནོད་སེམས་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་མཛེས་པ་དང་། སྐྱེ་བོ་མང་པོ་དགའ་ཞིང་ཡིད་དུ་འོང་བར་ཡང་འགྱུར་རོ།
en: “If bodhisattvas who abandon malice practice giving, their wealth will increase, and they will be beautiful, be liked by many people, and make an agreeable impression.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་བློ་ཐོགས་པ་མེད་ཅིང་སེམས་ཐོགས་པ་མེད་ལ་དབང་པོ་མ་ཚང་བ་མེད་པར་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, their minds and cognition will be unimpeded, and their faculties will all be complete.

source: །ལོག་པར་ལྟ་བ་སྤངས་པའི་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་པ་བྱིན་ན་ལོངས་སྤྱོད་ཆེ་བར་འགྱུར་ཞིང་སངས་རྒྱས་ལ་དད་པ་དང་ཡང་དག་པར་ལྟ་བའི་ཁྱིམ་དུ་སྐྱེའོ།
en: “If bodhisattvas who abandon wrong views practice giving, their wealth will increase, and they will be born into households that have faith in the Buddha and have correct views.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཡང་སངས་རྒྱས་ལ་ལྟ་བ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་འབྲལ་བར་མི་འགྱུར་རོ།
en: As they engage in bodhisattva conduct, they will never lose the opportunity to behold the Buddha, hear the Dharma, serve the Saṅgha, and develop the mind set on awakening.

source: །ཀླུའི་བདག་པོ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་སྦྱིན་པས་བརྒྱན་ན་དེ་ལྟར་མཐུ་ཆེ་ཞིང་ཕན་ཡོན་ཆེ་ལ་བྱིན་ཆེ་ཞིང་རྒྱ་ཆེ་བར་འགྱུར་རོ།
en: “Nāga Lord, if one adorns the path of the ten virtues with giving, one will thereby become more powerful, helpful, generous, and open.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཉིད་ཚུལ་ཁྲིམས་ཀྱིས་བརྒྱན་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་སྨོན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: If one adorns the path of the ten virtues with discipline, one will fulfill one’s aspiration toward all the qualities of buddhahood.

source: །བཟོད་པས་བརྒྱན་ན་མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་། སངས་རྒྱས་ཀྱི་གསུང་གི་གདངས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: If one adorns it with patience, one will perfect the major and minor marks of excellence and the perfect speech of buddhahood.

source: །བརྩོན་འགྲུས་ཀྱིས་བརྒྱན་ན་བདུད་ཕྱིར་རྒོལ་བ་འཇོམས་པ་དང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མཐར་ཕྱིན་པར་འགྱུར་རོ།
en: If one adorns it with diligence, one will defeat all māras and obstructors and bring all the qualities of buddhahood to completion.

source: །བསམ་གཏན་གྱིས་བརྒྱན་ན་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་། བརྟན་པ་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: If one adorns it with concentration, one will become wise, realized, conscientious, and stable.

source: །ཤེས་རབ་ཀྱིས་བརྒྱན་ན་ལྟ་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་འགྱུར་རོ།
en: If one adorns it with insight, one will truly defeat all views.

source: །བྱམས་པས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་དང་ཞེ་འགྲས་པ་མེད་པར་འགྱུར་རོ།
en: “If one adorns it with love, one will eliminate one’s aggression toward all beings.

source: །སྙིང་རྗེས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བར་འགྱུར་རོ།
en: If one adorns it with compassion, one will never abandon any being.

source: །དགའ་བས་བརྒྱན་ན་སེམས་ཞུམ་པ་མེད་པར་འགྱུར་རོ།
en: If one adorns it with joy, one’s mind will become dauntless.

source: །བཏང་སྙོམས་ཀྱིས་བརྒྱན་ན་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བར་འགྱུར་རོ།
en: If one adorns it with equanimity, one will abandon attachment and anger.

source: །བསྡུ་བའི་དངོས་པོས་བརྒྱན་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: If one adorns it with the means of attracting disciples, one will ripen all beings.

source: །དྲན་པ་ཉེ་བར་གཞག་པས་བརྒྱན་ན་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་མཁས་པར་འགྱུར་རོ།
en: If one adorns it with the applications of mindfulness, one will become learned in body, feelings, mind, and mental events.

source: །ཡང་དག་པའི་སྤོང་བས་བརྒྱན་ན་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: If one adorns it with the correct abandonments, one will abandon all nonvirtuous qualities and perfect all virtuous qualities.

source: །རྫུ་འཕྲུལ་གྱི་རྐང་པས་བརྒྱན་ན་ལུས་དང་སེམས་ཡང་དག་པར་འགྱུར་རོ།
en: If one adorns it with the bases of miraculous absorption, one’s body and mind will become perfect.

source: །དབང་པོ་ལྔས་བརྒྱན་ན་དད་པ་བརྟན་པ་དང་། བརྩོན་འགྲུས་བརྟན་པ་དང་། རྨོངས་པ་མེད་པ་དང་། སེམས་ལས་སུ་རུང་བ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ།
en: If one adorns it with the five faculties, one’s faith and diligence will be firm, and one will abandon all delusion, unworkable aspects of mind, and afflictions.

source: །སྟོབས་ཀྱིས་བརྒྱན་ན་རྫི་བ་མེད་པ་དང་། དགྲ་དང་འཁྲུག་པ་ཐམས་ཅད་ངེས་པར་འཇོམས་པར་འགྱུར་རོ།
en: If one adorns it with the strengths , one will be inviolable and will overcome all enemies and disturbances.

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་གིས་བརྒྱན་ན་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: If one adorns it with the branches of awakening, one will realize all phenomena genuinely and accurately.

source: །ལམ་གྱིས་བརྒྱན་ན་ཡང་དག་པའི་ཡེ་ཤེས་འདྲེན་པར་འགྱུར་རོ།
en: If one adorns it with the path, one will be guided by authentic wisdom.

source: །ཞི་གནས་ཀྱིས་བརྒྱན་ན་ཉོན་མོངས་པ་ཐམས་ཅད་ཚར་གཅོད་པར་འགྱུར་རོ།
en: If one adorns it with tranquility, one will destroy all the afflictions.

source: །ལྷག་མཐོང་གིས་བརྒྱན་ན་ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ།
en: If one adorns it with special insight, one will come to genuinely and accurately know all phenomena.

source: །ཐབས་ཀྱིས་བརྒྱན་ན་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་བདེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: If one adorns it with skillful means, one will perfect conditioned and unconditioned happiness.

source: །ཀླུའི་བདག་པོ་མདོར་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ཁོ་ནས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པ་དང་། མི་འཇིགས་པ་བཞི་ཡོངས་སུ་རྫོགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “In essence, Nāga Lord, it is solely through the path of the ten virtues that one can perfect the ten powers of the thus-gone ones, the fourfold fearlessness, and the qualities of buddhahood.

source: ཀླུའི་བདག་པོ་དེ་ལྟ་བས་ན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་རྒྱས་པར་རྣམ་པར་དབྱེ་བ་དང་། བརྒྱན་པར་བརྩོན་པར་བྱའོ།
en: Therefore, Nāga Lord, one should extensively discern these paths of the ten virtues and endeavor to adorn oneself with each of them.

source: །ཀླུའི་བདག་པོ་དཔེར་ན་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་ཐམས་ཅད་དང་། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ཤིང་ཐམས་ཅད་དང་། ལས་ཀྱི་མཐའ་ཐམས་ཅད་དང་། ས་བོན་གྱི་ཚོགས་ཐམས་ཅད་དང་། ལོ་ཏོག་ཐམས་ཅད་སྐྱེ་ཞིང་རྨོ་བ་དང་། ཤལ་བས་བཤལ་བ་དང་། འབྱུང་བ་རྣམས་ནི་ས་ལ་གནས་ཏེ།
en: Nāga Lord, to draw an analogy, all villages, towns, cities, regions, countrysides, and royal palaces dwell upon the earth, as do all grasses, trees, herbs, and bushes, all types of action, all collections of seeds, the germinating and plowing of all crops, the harrowing of fields, and everything that grows upward.

source: དེ་དག་གི་གནས་ནི་ས་ཡིན་ནོ།
en: The earth is their support.

source: །ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་འདི་དག་ནི་ལྷ་དང་། མིར་སྐྱེ་བ་དང་། སློབ་པ་དང་། མི་སློབ་པའི་དགེ་སྦྱོང་གི་འབྲས་བུ་འཐོབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་གནས་ཡིན་ནོ།
en: In a similar way, Nāga Lord, the path of the ten virtues is the support for rebirth among the gods and humans, the attainment of the result sought by monastics on the paths of training and no-more-training, the awakening of solitary buddhas, the conduct of bodhisattvas, and the qualities of buddhahood.

source: །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་དྲུག་པའོ།།
en: Chapter Six: Being Supported by the Path of the Ten Virtues

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་སྒོར་འཇུག་པ་གང་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་ལས་ཀྱི་སྒྲིབ་པའི་ནོངས་པ་རྣམས་སྤོང་ཞིང་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་སྤངས་ནས་ཀྱང་ཁྱད་པར་གྱི་གནས་སུ་མཆི་བར་འགྱུར་བའི་ཆོས་ཀྱི་སྒོར་འཇུག་པ་གང་ལགས།
en: Nāga King Sāgara then said to the Blessed One, “Blessed One, through what Dharma door should bodhisattvas enter such that not only do they abandon all the flaws of previous karmic obscuration, but, having abandoned all karmic obscuration, they proceed to become distinguished persons? What Dharma door should they enter?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་ཆོས་གཅིག་གིས་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: The Blessed One answered, “Nāga Lord, the continuity of all karmic obscuration is severed by a single quality.

source: ཆོས་གཅིག་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What is this single quality?

source: སྡོམ་པ་ལ་གནས་པ་ཉེས་པ་བྱུང་བ་འཆགས་པ་སྟེ་གཅིག་ནི་དེ་ཡིན་ནོ།
en: It is to abide by one’s vows and, should a fault occur, to confess it.

source: །ཀླུའི་བདག་པོ་ཆོས་གཉིས་ཀྱིས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: Nāga Lord, the continuity of karmic obscuration is severed by two qualities.

source: གཉིས་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these two?

source: ཚུལ་བཞིན་དུ་ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། ད་ལྟར་བྱུང་བ་མངོན་པར་འདུ་མི་བྱེད་པ་སྟེ། དེ་གཉིས་སོ།
en: They are to discriminate the Dharma accurately and to not have preconceptions about what is presently arising.

source: །ཀླུའི་བདག་པོ་ཆོས་གསུམ་གྱིས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: Nāga Lord, the continuity of karmic obscuration is severed by three qualities.

source: རྐྱེན་གྱི་ཆོས་ལ་འཇུག་པའི་ཤེས་པ་ལ་སོ་སོར་རྟོག་པ་དང་། མི་གསར་མི་རྙིང་བའི་ཆོས་ལ་སོ་སོར་རྟོག་པ་དང་། རང་བཞིན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཆོས་རྣམས་ལ་སོ་སོར་རྟོག་པ་སྟེ་གསུམ་པོ་དེ་དག་གོ།
en: They are the discrimination of the consciousness that engages conditional phenomena, the discrimination of phenomena that are neither new nor old, and the discrimination of phenomena that are naturally without affliction.

source: །ཀླུའི་བདག་པོ་ཆོས་བཞིས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: Nāga Lord, the continuity of karmic obscuration is severed by four qualities.

source: སྟོང་པ་ཉིད་ལ་ངེས་པར་སེམས་པ་དང་། མཚན་མ་མེད་པ་ལ་གནས་པ་དང་། སྨོན་པ་དང་བྲལ་བ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ཤེས་པ་སྟེ། བཞི་པོ་དེ་དག་གོ།
en: They are certainty in emptiness, abiding in the absence of marks, freedom from wishing, and unconditioned consciousness.

source: །ཀླུའི་བདག་པོ་ཆོས་ལྔས་ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་ཆད་པར་འགྱུར་ཏེ།
en: Nāga Lord, the continuity of karmic obscuration is severed by five qualities.
